
## Plan Result (system_a)

[CI link](https://github.com/nangashi/dcr/actions/runs/7397880154)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.monthly_aggregate.aws_lambda_function.this[0]
* Replace
  * aws_lambda_layer_version.main
  * module.monthly_aggregate.null_resource.archive[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_layer_version.main must be replaced
-/+ resource "aws_lambda_layer_version" "main" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-12-30T13:43:08.019+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "E0YZ1+8tLp0jcR613qaiit1geWNeySVRX3uJbz0V7fQ=" -> "CnmshC5lxfVy42JWRnfMFmO9rkMvuyUnsy6DJcSpTog=" # forces replacement
      ~ source_code_size            = 19151492 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.monthly_aggregate.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "MonthlyAggregate-prd"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.monthly_aggregate.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5847702089767261280" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1704031936862296200" -> "1704288525548369800"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":40,"Program":"tfcmt","SHA1":"dd64af1bf8289097b966aaeec71af0eef8df0374","Target":"system_a","Vars":{},"WorkflowName":"Check Pull Requests"} -->